# GetHandRails Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..GetHandRails Method
Railing Class See Also
---
Get all the handrails of the railing.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetHandRails()
```

Visual Basic
---
```text
Public Function GetHandRails As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetHandRails()
```

# ### Return Value
All handrails of the railing.
# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace